/**
 * 1. 第一章: 面试题
 */

/**
 * 1. 关于面试:
 *
 * 1. 基层工程师: 基础知识
 * 2. 高级工程师: 项目经验
 *    1. 项目经验 、 带过那些队 、 有那些坑的项目经验 。
 * 3. 架构师: 解决方案
 *    1. 相当于一个部门, 一个项目组的技术带头人 。
 */


/**
 * 2. 面试题目总结:
 *
 *
 * 1. js 使用 typeof 能够得到哪些类型
 *    1. 考点: js 变量类型
 *    1. 拓展: 变量的计算 / 变量的转换
 *
 * 2. 何时使用 === 何时使用 ==
 *    1. 考点: 强制类型转换
 *    2. 拓展: 强制类型转换可能是在逻辑运算中做, 也有可能是在 if 语句中做
 *
 * 3. window.onload 和 DOMContentLoaded 的区别
 *    1. 考点: 浏览器的渲染过程
 *
 * 4. 使用 js 创建 10 个 a 标签, 点击的时候探出对应的序号
 *    1. 考点: 作用域
 *
 * 5. 简述如何实现一个 模块加载器, 实现 require.js 的基本功能
 *    1. 考点: js 模块化
 *
 * 6. 实现数组的 随机排序
 *    1. 考点: js 的基础算法
 */



/**
 * 3. 具体的面试题目:
 *
 * 1. b-chapter (变量类型 / 变量计算)
 *    1. js 使用 typeof 能够得到哪些类型 ？
 *    2. 何时使用 === 何时使用 ==？
 *    3. js 中有哪些内置函数 ？
 *    4. js 变量按照存储方式 区分为哪些类型， 并描述其特点？
 *    5. 如何理解 json？
 * 1. b-chapter (原型 / 原型链)
 *    1. 如何判断一个变量是 数组类型
 *    2. 写一个原型链继承的例子
 *    3. 描述 new 一个对象的过程
 *    4. zepto (或其他框架) 源码中如何使用原型链
 *
 * 2. c-chapter (作用域 / 闭包)
 *    1. 说一下对变量提升的理解。
 *    2. 说明 this 不同的使用场景。
 *    3. 如何理解作用域。
 *    4. 创建 10 个 a 标签， 点击的时候弹出对应的序号。
 *    5. 实际开发中闭包的应用 (闭包: 是 作用域 与 作用域链 的一个具体的呈现。)。
 *
 * 3. d-chapter (异步 / 单线程)
 *    1. 同步和异步的区别是什么？ 分别举一个同步和异步的例子。
 *    2. 一个关于 settTimeout 的笔试题。
 *    3. 前端使用异步的场景有哪些 ？
 * 3. d-chapter (日期 / math / 数组 / 对象)
 *    1. 获取 2017-06-07 格式的日期。
 *    2. 获取随机数, 要求是长度一致的字符串格式。
 *    3. 写一个能遍历对象和数组的通用 forEach 函数。
 *
 * 4. e-chapter
 *    1. DOM 是那种基本的数据结构 ？
 *    2. DOM 操作常用的 api 有哪些 ？
 *    3. DOM 节点的 attr 与 property 有何区别 ？
 *    4. 如何检测浏览器的类型 (还有系统类型, 主要是针对移动端)？
 *    5. 解析 url 的各个部分
 *
 * 5. f-chapter (事件/ ajax)
 *    1. 描述事件冒泡的流程
 *    2. 完善我们通用绑定事件的函数
 *    3. 手动编写一个 ajax, 不依赖第三方库
 *    4. 跨域的几种实现方式
 *    5. 描述 cookie , sessionStorage , localStorage 的区别 ？
 *
 * 6. g-chapter (开发环境)
 */