/**
 * 1. 第五章 - JS-Web-API: DOM 本质
 *
 * 1. DOM 的本质是什么
 */

/**
 * 1. DOM 操作:
 *
 * 1. DOM 是 Document-Object-Model 的简称; 文档对象模型 。
 */

/**
 * 2. 面试题目:
 *  1. DOM 是那种基本的数据结构 ？
 *  2. DOM 操作常用的 api 有哪些 ？
 *  3. DOM 节点的 Attribute 与 property 有何区别 ？
 */

/**
 * 3. 知识点:
 *  1. DOM 的本质是什么 ？
 *  2. DOM 的节点操作 ？
 *  3. DOM 的结构操作 ？
 */

/**
 * 1. DOM 的本质是什么 ？
 *    1. 浏览器把拿到的 HTML 代码, 结构化为一个浏览器可识别并且 js 可操作的一个 结构化的树形结构模型 而已 。
 *    2. 浏览器拿到服务器的 .html 代码, 将 html 代码结构化成 浏览器可识别 与 js可操作 (DOM 的节点操作和 DOM 的结构操作就体现了 js 可识别的内容) 的一个模型而已, 这个模型就是 dom 。
 *    3. dom 结构是和 html 非常相似的 (dom 是一个很虚化的东西), 但是 dom 结构不是 html 代码, html 代码就是一个字符串, 但是浏览器已经将其 结构化的树形结构 (也就是浏览器将 html字符串 结构化)。
 */